In this notebook, we will cover:

* [Separating](#Separating)
* [Uniting](#Uniting)
* [Missing Values](#Missing-Values)

In [1]:
library(tidyverse)

── Attaching packages ─────────────────────────────────────── tidyverse 1.3.0 ──

✔ ggplot2 3.2.1     ✔ purrr   0.3.3
✔ tibble  2.1.3     ✔ dplyr   0.8.4
✔ tidyr   1.0.2     ✔ stringr 1.4.0
✔ readr   1.3.1     ✔ forcats 0.4.0

── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()

# Separating

In [2]:
table3

  country     year rate
1 Afghanistan 1999 745/19987071
2 Afghanistan 2000 2666/20595360
3 Brazil      1999 37737/172006362
4 Brazil      2000 80488/174504898
5 China       1999 212258/1272915272
6 China       2000 213766/1280428583

In [3]:
print(table3)

# A tibble: 6 x 3
  country      year rate
* <chr>       <int> <chr>
1 Afghanistan  1999 745/19987071
2 Afghanistan  2000 2666/20595360
3 Brazil       1999 37737/172006362
4 Brazil       2000 80488/174504898
5 China        1999 212258/1272915272
6 China        2000 213766/1280428583

In [4]:
(separated_table3 <- separate(table3, rate, into = c("cases", "population"), sep = "/"))

  country     year cases  population
1 Afghanistan 1999 745    19987071
2 Afghanistan 2000 2666   20595360
3 Brazil      1999 37737  172006362
4 Brazil      2000 80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583

In [5]:
print(separated_table3)

# A tibble: 6 x 4
  country      year cases  population
  <chr>       <int> <chr>  <chr>
1 Afghanistan  1999 745    19987071
2 Afghanistan  2000 2666   20595360
3 Brazil       1999 37737  172006362
4 Brazil       2000 80488  174504898
5 China        1999 212258 1272915272
6 China        2000 213766 1280428583

The types of the `cases` and `populations` columns are not right. We can change that ourselves.

In [6]:
print(mutate(separated_table3, cases = as.integer(cases), population = as.integer(population)))

# A tibble: 6 x 4
  country      year  cases population
  <chr>       <int>  <int>      <int>
1 Afghanistan  1999    745   19987071
2 Afghanistan  2000   2666   20595360
3 Brazil       1999  37737  172006362
4 Brazil       2000  80488  174504898
5 China        1999 212258 1272915272
6 China        2000 213766 1280428583

Alternatively, we can ask `separate()` to try and convert to a better type.

In [7]:
(separated_table3 <- separate(table3, rate, into = c("cases", "population"), sep = "/", convert = TRUE))

  country     year cases  population
1 Afghanistan 1999    745   19987071
2 Afghanistan 2000   2666   20595360
3 Brazil      1999  37737  172006362
4 Brazil      2000  80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583

In [8]:
print(separated_table3)

# A tibble: 6 x 4
  country      year  cases population
  <chr>       <int>  <int>      <int>
1 Afghanistan  1999    745   19987071
2 Afghanistan  2000   2666   20595360
3 Brazil       1999  37737  172006362
4 Brazil       2000  80488  174504898
5 China        1999 212258 1272915272
6 China        2000 213766 1280428583

# Uniting

In [9]:
(separated_year <- separate(table3, year, into = c("century", "year"), sep = 2))

  country     century year rate
1 Afghanistan 19      99   745/19987071
2 Afghanistan 20      00   2666/20595360
3 Brazil      19      99   37737/172006362
4 Brazil      20      00   80488/174504898
5 China       19      99   212258/1272915272
6 China       20      00   213766/1280428583

In [10]:
unite(separated_year, new, century, year)

  country     new   rate
1 Afghanistan 19_99 745/19987071
2 Afghanistan 20_00 2666/20595360
3 Brazil      19_99 37737/172006362
4 Brazil      20_00 80488/174504898
5 China       19_99 212258/1272915272
6 China       20_00 213766/1280428583

In [11]:
unite(separated_year, new, century, year, sep = "")

  country     new  rate
1 Afghanistan 1999 745/19987071
2 Afghanistan 2000 2666/20595360
3 Brazil      1999 37737/172006362
4 Brazil      2000 80488/174504898
5 China       1999 212258/1272915272
6 China       2000 213766/1280428583

# Missing Values

Missing values can be:

* **Explicit**, or
* **Implicit**

In [12]:
(stocks <- tibble(
  year   = c(2015, 2015, 2015, 2015, 2016, 2016, 2016),
  qtr    = c(   1,    2,    3,    4,    2,    3,    4),
  return = c(1.88, 0.59, 0.35,   NA, 0.92, 0.17, 2.66)
))

  year qtr return
1 2015 1   1.88
2 2015 2   0.59
3 2015 3   0.35
4 2015 4     NA
5 2016 2   0.92
6 2016 3   0.17
7 2016 4   2.66

The **complete** command makes implicit missing value explicit by considering all combinations of unique values of specified variables.

In [13]:
complete(stocks, year, qtr)

  year qtr return
1 2015 1   1.88
2 2015 2   0.59
3 2015 3   0.35
4 2015 4     NA
5 2016 1     NA
6 2016 2   0.92
7 2016 3   0.17
8 2016 4   2.66

The missing values also become explicit if we use `pivot_wider()` on the tibble.

In [14]:
pivot_wider(stocks, names_from = year, values_from = return)

  qtr 2015 2016
1 1   1.88   NA
2 2   0.59 0.92
3 3   0.35 0.17
4 4     NA 2.66

`pivot_longer()` will keep all these explicitly missing values by default.

In [15]:
stocks %>%
    pivot_wider(names_from = year, values_from = return) %>%
    pivot_longer(c(`2015`, `2016`), names_to = "year", values_to = "return")

  qtr year return
1 1   2015 1.88
2 1   2016   NA
3 2   2015 0.59
4 2   2016 0.92
5 3   2015 0.35
6 3   2016 0.17
7 4   2015   NA
8 4   2016 2.66

If you don't like the default behavior of `pivot_longer()`, you can turn off explicit missing values using the `values_drop_na` argument.

In [16]:
stocks %>%
    pivot_wider(names_from = year, values_from = return) %>%
    pivot_longer(c(`2015`, `2016`), names_to = "year", values_to = "return", values_drop_na = TRUE)

  qtr year return
1 1   2015 1.88
2 2   2015 0.59
3 2   2016 0.92
4 3   2015 0.35
5 3   2016 0.17
6 4   2016 2.66

**Imputation** refers to process of filling in missing values. There are many imputation method. One of the simplest ones is *last observation carry forward*. You can do that using the **fill** command.

In [17]:
stocks %>%
    fill(return)

  year qtr return
1 2015 1   1.88
2 2015 2   0.59
3 2015 3   0.35
4 2015 4   0.35
5 2016 2   0.92
6 2016 3   0.17
7 2016 4   2.66

In [18]:
stocks %>% 
    fill(return, .direction = "up") # next observation carry backwards!

  year qtr return
1 2015 1   1.88
2 2015 2   0.59
3 2015 3   0.35
4 2015 4   0.92
5 2016 2   0.92
6 2016 3   0.17
7 2016 4   2.66